# UsesReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..UsesReference Method
PartMakerMethodToDivideVolumes Class See Also
---
Identifies if the PartMaker uses the intersecting reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool UsesReference(
	ElementId intersectingReference
)
```

Visual Basic
---
```text
Public Function UsesReference ( _
	intersectingReference As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool UsesReference(
	ElementId^ intersectingReference
)
```

# ### Parameters
intersectingReference
    Type: Autodesk.Revit.DB..::..ElementId Intersecting reference to be tested.
# ### Return Value
True if the intersecting reference is used by the PartMaker.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace